{"p_tags": ["According to the latest research by Elara Capital based on EPFR's global fund flows and allocation data, \"Global Equity flows have been slowing since the past few weeks. After strong inflows since September '23, US flows have been showing initial signs of slowdown. On a 4-week rolling basis, US funds have seen the biggest outflows since August '23. Although the absolute quantum is still small, there is a change in trend after 6 months. Weaker US flows are largely on back of slowdown of inflows in technology funds.\"", "The research indicates that India flows have also slowed down in the past few weeks, but the country remains among the strongest regions for foreign investors, along with Japan. \"Last week's inflow of $114 million into India-dedicated funds is the lowest since May 2023. The biggest slowdown in India flows is from Luxembourg investors.\"", "", "Sunil Jain, Head, Quantitative & Alternates, Elara Capital, believes that, \"The recent events (geopolitical tensions)  can trigger further redemptions in the mid and smallcap space, but we don't see this converting into a bigger trend of outflows as of now. Largecap flows can become strong hereon.\"", "\"SEBIs repeated emphasis on froth in Smallcap schemes finally managed to break the momentum of flows for first time since Aug 2021 Foreign mutual fund flows into India's mid and small caps have already been weak for the past few months,\" added Jain.", "India: Midcap funds and largecap trends", "", "According to Elara Capital's report, India-dedicated midcap funds witnessed slower redemptions for the sixth week in a row. While the long-term trend in India's largecap flows remains unchallenged, the trend in India-dedicated midcap flows is showing signs of reversal for the first time since June 2021.", "Also read: F&O Manual|Indices trade lower; Nifty crucial resistance at 22,500, avoid long bets, say analysts", "China recovery", "The report also highlights that China has stopped underperforming India since the start of CY24, after steep underperformance in CY23. China has seen one big round of inflows from domestic investors between December 2023 to March 2024. However, foreign investors have still not participated in this first round of China's recovery (around 15 percent) from its lows.", "Also read: Option strategy of the day| Bull run in Bajaj Auto backed by volume; buy 9,100 CE advised", "\"Currently, Chinese markets are facing resistance at the 200-day moving average level for the past month, and domestic flows have also entered a wait-and-watch mode. If it manages to cross this level, we could see increased participation from foreigners who have not yet participated,\" Jain explained.", "Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions."]}