{
    "site_name": "MoneyControl",
    "article_title": "TCS to set up first-of-its-kind human-centric AI center of excellence in France",
    "article_desc": "The new center will focus on pushing the boundaries of how AI can be designed and evolved to address business efficiencies and societal priorities.",
    "left_block_content": "\n\nMoneycontrol News\n  May 13, 2024 / 08:58 PM IST   ",
    "p_tags": [
        "Tata Consultancy Services on 13 May has announced the creation of a Global Artificial Intelligence (AI) Center of Excellence in Paris, during the Choose France Summit, hosted by French President Emmanuel Macron. The summit was attended by 300 global CEOs, including N. Chandrasekaran, the Chairman of Tata Sons. The new AI center will be based in the upcoming TCS PacePort in the La Défense area of Paris, which will be inaugurated in June 2024, becoming the 7th such facility in TCS’ global Pace network, following Amsterdam, London, New York, Pittsburgh, Toronto, and Tokyo.",
        "The center will, initially, focus on areas such as brain-computer interface, building empathy in machines, and unleashing the power of AI in arts and culture. The leading position that Paris has as a global hub of culture, arts and design will provide added impetus to this initiative.",
        "\"The TCS AI Center of Excellence in Paris will leverage TCS’ global ecosystem of startups, academia, and research organizations to bring the best of global capabilities to French companies,\"TCS said in a statement. The new center will join France’s growing AI ecosystem and tap into its deep talent base in design and engineering, to build advanced technologies in the space of human-centric AI. It will focus on pushing the boundaries of how AI can be designed and evolved to address business efficiencies and societal priorities. The impact areas shall include some of the key priorities listed in France’s National Strategy for AI, as part of the France 2030 plan.",
        "Valerie Pecresse, President of the Regional Council of the Ile-de-France region, said, “Paris region is fast developing into one of the global epicenters for Artificial Intelligence. We are delighted to see this new investment by TCS, which will boost the AI ecosystem we are looking to develop and provide new opportunities to our students and professionals. I look forward to inaugurating this center in June.”",
        "Dr. Harrick Vin, Chief Technology Officer, TCS, said, “The need of the hour is to boost AI skills present in the country, accelerate the adoption of AI in the French economy, and develop global capabilities here that will benefit the rest of the world. Our new AI center in Paris will focus on many of these areas, including the development of talent and leveraging the world-renowned culture that France has for design – reflected in its fashion, luxury sector and museums. We will seek to deepen our partnerships with universities, startups, and research centers in the country, as we operationalize this center in the coming weeks.”",
        "“We are very proud of the growth of our operations in France and the nature of the complex and high-value digital services we provide for our clients. Our new investments in the TCS PacePort in Paris and the TCS AI Center of Excellence are demonstrations of our ongoing commitment to building capabilities in the most advanced technologies and bringing them to bear for our clients in the country and across the world. The new center will focus on boosting human-centered AI capabilities for the banking & financial services, manufacturing, and consumer sectors, to start with. We will hire new talent and partner with universities to offer internships and projects, to support the National AI Mission,” said Rammohan Gourneni, Country Head, TCS France.\n       "
    ]
}